
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаПоизицииТоваров Из ПозицииТоваров Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Продавец = Продавец;
		Движение.Товар = ТекСтрокаПоизицииТоваров.Товар;
		Движение.Покупатель = Покупатель;
		Движение.Сумма = ТекСтрокаПоизицииТоваров.Итого;
		Движение.КоличествоПроданныхТоваров = ТекСтрокаПоизицииТоваров.Количество;
	КонецЦикла;

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаПоизицииТоваров Из ПозицииТоваров Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Партия = ТекСтрокаПоизицииТоваров.Партия;
		Движение.Товар = ТекСтрокаПоизицииТоваров.Товар;
		Движение.Количество = ТекСтрокаПоизицииТоваров.Количество;
		Движение.Сумма = ТекСтрокаПоизицииТоваров.Итого;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
