
&НаКлиенте
Процедура ПозицииТоваровЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПозицииТоваров.ТекущиеДанные;
	СтрокаТабличнойЧасти.Итого = (СтрокаТабличнойЧасти.Цена - ((СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Скидка) / 100)) * СтрокаТабличнойЧасти.Количество;
	Объект.СуммаПродажи = Объект.ПозицииТоваров.Итог("Итого");
КонецПроцедуры

&НаКлиенте
Процедура ПозицииТоваровСкидкаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПозицииТоваров.ТекущиеДанные;	
	СтрокаТабличнойЧасти.Итого = (СтрокаТабличнойЧасти.Цена - ((СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Скидка) / 100)) * СтрокаТабличнойЧасти.Количество;
	Объект.СуммаПродажи = Объект.ПозицииТоваров.Итог("Итого");
КонецПроцедуры

&НаКлиенте
Процедура ПозицииТоваровКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПозицииТоваров.ТекущиеДанные;	
	СтрокаТабличнойЧасти.Итого = (СтрокаТабличнойЧасти.Цена - ((СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Скидка) / 100)) * СтрокаТабличнойЧасти.Количество;
	Объект.СуммаПродажи = Объект.ПозицииТоваров.Итог("Итого");
КонецПроцедуры

&НаСервере
Процедура ПозицииТоваровТоварПриИзмененииНаСервере(Товар, Цена)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Товар);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Цена = ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииТоваровТоварПриИзменении(Элемент)
	ТекСтрока = Элементы.ПозицииТоваров.ТекущиеДанные;
	ПозицииТоваровТоварПриИзмененииНаСервере(ТекСтрока.Товар, ТекСтрока.Цена);
КонецПроцедуры



